---
kind: method
id: M:Autodesk.Revit.DB.ExtrusionAnalyzer.GetExtrusionBase
source: html/3e24586d-4a80-5331-8e79-74d1b6249ca6.htm
---
# Autodesk.Revit.DB.ExtrusionAnalyzer.GetExtrusionBase Method

Obtains the face that represents the base contour of the extrusion analysis.

## Syntax (C#)
```csharp
public Face GetExtrusionBase()
```

## Returns
The face that represents the base contour.